app/controllers/events_controller.rb

    def index
        render json: Event.all
---
SELECT "events".* FROM "events"