app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-02-14 19:34:02.568201"], ["updated_at", "2019-02-14 19:34:02.568201"]]
INSERT INTO "events" ("date", "title", "description", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        event = Event.create(event_params)

        event.organizers << current_user
        # event.attendees << current_user
        event.save

INSERT INTO "events" ("date", "title", "description", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create_attendee

        current_event.attendees << current_user

SELECT "events".* FROM "events"
---
    def index
        render json: Event.all

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
    def show
        showevent = Event.all.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
    def define_current_event
        if params[:id]
            @current_event = Event.find(params[:id])