app/controllers/user_events_controller.rb

    def create
        userevent = UserEvent.create(userevent_params)
---
INSERT INTO "user_events" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 10], ["event_id", 39], ["created_at", "2019-02-15 01:14:30.442598"], ["updated_at", "2019-02-15 01:14:30.442598"]]

    def define_current_userevent
        if params[:id]
            @current_userevent = UserEvent.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]