app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "name", "school", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def define_selected_user
        if params[:id]
            @selected_user = User.find(params[:id])